## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for dev environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SOPS"
                              + property = "data.SOPS"
                            }
                          + secretKey = "SOPS"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "REDIS"
                                metadataPolicy     = "None"
                                property           = "data.REDIS_PASSWORD"
                                version            = null
                            }
                            secretKey = "REDIS_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for stg environment...
##
#########################################################

#########################################################
##
##   Planning changes for prod environment...
##
#########################################################

#########################################################
##
##   Planning changes for sandbox environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cloudflare"] will be destroyed
  # (because key ["kv/cloudflare"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cloudflare" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.273309774Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "5"
        } -> null
      - mount               = "kv" -> null
      - name                = "cloudflare" -> null
      - path                = "kv/data/cloudflare" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/AWS_ACCESS_KEY_ID"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/AWS_ACCESS_KEY_ID"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/AWS_ACCESS_KEY_ID" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.271195768Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "4"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/AWS_ACCESS_KEY_ID" -> null
      - path                = "kv/data/cluster-secret-store/secrets/AWS_ACCESS_KEY_ID" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.303380814Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY" -> null
      - path                = "kv/data/cluster-secret-store/secrets/AWS_SECRET_ACCESS_KEY" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.273597829Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD" -> null
      - path                = "kv/data/cluster-secret-store/secrets/EXTERNAL_DNS_PIHOLE_PASSWORD" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/GITHUB_PAT"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/GITHUB_PAT"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/GITHUB_PAT" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.270891308Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "4"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/GITHUB_PAT" -> null
      - path                = "kv/data/cluster-secret-store/secrets/GITHUB_PAT" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/KUBECONFIG"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/KUBECONFIG"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/KUBECONFIG" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.279544451Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "10"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/KUBECONFIG" -> null
      - path                = "kv/data/cluster-secret-store/secrets/KUBECONFIG" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/MINIO"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/MINIO"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/MINIO" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.263333756Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/MINIO" -> null
      - path                = "kv/data/cluster-secret-store/secrets/MINIO" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/POSTGRES"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/POSTGRES"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/POSTGRES" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.253781629Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "4"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/POSTGRES" -> null
      - path                = "kv/data/cluster-secret-store/secrets/POSTGRES" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/PROXMOX_PASSWORD"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/PROXMOX_PASSWORD"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/PROXMOX_PASSWORD" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.302450029Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "4"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/PROXMOX_PASSWORD" -> null
      - path                = "kv/data/cluster-secret-store/secrets/PROXMOX_PASSWORD" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/REDIS"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/REDIS"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/REDIS" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.308491442Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "5"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/REDIS" -> null
      - path                = "kv/data/cluster-secret-store/secrets/REDIS" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/SSH_PRIVATE_KEY"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/SSH_PRIVATE_KEY"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/SSH_PRIVATE_KEY" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.26933956Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/SSH_PRIVATE_KEY" -> null
      - path                = "kv/data/cluster-secret-store/secrets/SSH_PRIVATE_KEY" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.250076923Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD" -> null
      - path                = "kv/data/cluster-secret-store/secrets/TF_VAR_PROXMOX_PASSWORD" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.310872461Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN" -> null
      - path                = "kv/data/cluster-secret-store/secrets/TF_VAR_VAULT_TOKEN" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secret-store/secrets/VAULT_TOKEN"] will be destroyed
  # (because key ["kv/cluster-secret-store/secrets/VAULT_TOKEN"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secret-store/secrets/VAULT_TOKEN" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.268257259Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secret-store/secrets/VAULT_TOKEN" -> null
      - path                = "kv/data/cluster-secret-store/secrets/VAULT_TOKEN" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/cluster-secrets"] will be destroyed
  # (because key ["kv/cluster-secrets"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/cluster-secrets" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.315419252Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "8"
        } -> null
      - mount               = "kv" -> null
      - name                = "cluster-secrets" -> null
      - path                = "kv/data/cluster-secrets" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/github-runner"] will be destroyed
  # (because key ["kv/github-runner"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/github-runner" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.307893236Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "11"
        } -> null
      - mount               = "kv" -> null
      - name                = "github-runner" -> null
      - path                = "kv/data/github-runner" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/gitlab-runner"] will be destroyed
  # (because key ["kv/gitlab-runner"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/gitlab-runner" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.324296855Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "14"
        } -> null
      - mount               = "kv" -> null
      - name                = "gitlab-runner" -> null
      - path                = "kv/data/gitlab-runner" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

  # module.vault[0].vault_kv_secret_v2.initial_secrets["kv/jenkins"] will be destroyed
  # (because key ["kv/jenkins"] is not in for_each map)
  - resource "vault_kv_secret_v2" "initial_secrets" {
      - data                = (sensitive value) -> null
      - data_json           = (sensitive value) -> null
      - delete_all_versions = false -> null
      - disable_read        = false -> null
      - id                  = "kv/data/jenkins" -> null
      - metadata            = {
          - "created_time"    = "2025-04-06T17:16:04.314501908Z"
          - "custom_metadata" = "null"
          - "deletion_time"   = null
          - "destroyed"       = "false"
          - "version"         = "3"
        } -> null
      - mount               = "kv" -> null
      - name                = "jenkins" -> null
      - path                = "kv/data/jenkins" -> null

      - custom_metadata {
          - cas_required         = false -> null
          - data                 = {} -> null
          - delete_version_after = 0 -> null
          - max_versions         = 0 -> null
        }
    }

Plan: 0 to add, 0 to change, 18 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.external_secrets[0].kubernetes_manifest.cluster_secrets[0] will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_secrets" {
      ~ manifest = {
          ~ spec       = {
              ~ externalSecretSpec = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                key      = "REDIS"
                                property = "data.REDIS_PASSWORD"
                            }
                            secretKey = "REDIS_PASSWORD"
                        },
                      + {
                          + remoteRef = {
                              + key      = "SOPS"
                              + property = "data.SOPS"
                            }
                          + secretKey = "SOPS"
                        },
                    ]
                    # (3 unchanged attributes hidden)
                }
                # (3 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
      ~ object   = {
          ~ spec       = {
              ~ externalSecretSpec     = {
                  ~ data            = [
                        # (9 unchanged elements hidden)
                        {
                            remoteRef = {
                                conversionStrategy = "Default"
                                decodingStrategy   = "None"
                                key                = "REDIS"
                                metadataPolicy     = "None"
                                property           = "data.REDIS_PASSWORD"
                                version            = null
                            }
                            secretKey = "REDIS_PASSWORD"
                            sourceRef = {
                                generatorRef = {
                                    apiVersion = null
                                    kind       = null
                                    name       = null
                                }
                                storeRef     = {
                                    kind = null
                                    name = null
                                }
                            }
                        },
                      + {
                          + remoteRef = {
                              + conversionStrategy = (known after apply)
                              + decodingStrategy   = (known after apply)
                              + key                = "SOPS"
                              + metadataPolicy     = (known after apply)
                              + property           = "data.SOPS"
                              + version            = (known after apply)
                            }
                          + secretKey = "SOPS"
                          + sourceRef = {
                              + generatorRef = {
                                  + apiVersion = (known after apply)
                                  + kind       = (known after apply)
                                  + name       = (known after apply)
                                }
                              + storeRef     = {
                                  + kind = (known after apply)
                                  + name = (known after apply)
                                }
                            }
                        },
                    ]
                    # (4 unchanged attributes hidden)
                }
                # (6 unchanged attributes hidden)
            }
            # (3 unchanged attributes hidden)
        }
    }

  # module.fluent[0].module.helm.helm_release.this will be updated in-place
  ~ resource "helm_release" "this" {
        id                         = "fluent"
      ~ metadata                   = [
          - {
              - app_version    = "3.2.8"
              - chart          = "fluent-bit"
              - first_deployed = 1742557965
              - last_deployed  = 1742594261
              - name           = "fluent"
              - namespace      = "default"
              - notes          = <<-EOT
                    Get Fluent Bit build information by running these commands:
                    
                    export POD_NAME=$(kubectl get pods --namespace default -l "app.kubernetes.io/name=fluent-bit,app.kubernetes.io/instance=fluent" -o jsonpath="{.items[0].metadata.name}")
                    kubectl --namespace default port-forward $POD_NAME 2020:2020
                    curl http://127.0.0.1:2020
                EOT
              - revision       = 8
              - values         = jsonencode(
                    {
                      - config     = {
                          - filters = <<-EOT
                                [FILTER]
                                    Name                kubernetes
                                    Match               kube.*
                                    Kube_URL            https://kubernetes.default.svc:443
                                    Kube_CA_File        /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                                    Kube_Token_File     /var/run/secrets/kubernetes.io/serviceaccount/token
                                    Kube_Tag_Prefix     kube.var.log.containers.
                                    Merge_Log           On
                                    Merge_Log_Key       log_processed
                                    K8S-Logging.Parser  On
                                    K8S-Logging.Exclude Off
                                    
                                [FILTER]
                                    Name                record_modifier
                                    Match               *
                                    Record              log_format structured
                                    
                                [FILTER]
                                    Name                lua
                                    Match               kube.var.log.containers.trace-demo*
                                    Script              /fluent-bit/scripts/extract_trace_id.lua
                                    Call                extract_trace_id
                                
                                [FILTER]
                                    Name                lua
                                    Match               kube.*
                                    Script              /fluent-bit/scripts/filter_health_checks.lua
                                    Call                filter_health_checks
                            EOT
                          - inputs  = <<-EOT
                                [INPUT]
                                    Name              tail
                                    Tag               kube.*
                                    Path              /var/log/containers/*.log
                                    Parser            docker
                                    DB                /var/log/flb_kube.db
                                    Mem_Buf_Limit     5MB
                                    Skip_Long_Lines   On
                                    Refresh_Interval  10
                            EOT
                          - outputs = <<-EOT
                                [OUTPUT]
                                    Name                   loki
                                    Match                  *
                                    Host                   loki.fullstack.pw
                                    Port                   443
                                    TLS                    On
                                    Labels                 job=fluentbit,cluster=tools
                                    Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app']
                                    Remove_Keys            stream
                                    Auto_Kubernetes_Labels On
                                    Line_Format            json
                            EOT
                        }
                      - luaScripts = {
                          - "extract_trace_id.lua"     = <<-EOT
                                function extract_trace_id(tag, timestamp, record)
                                    local log = record["log"]
                                    
                                    if type(log) == "string" then
                                        -- Try to extract trace ID using pattern matching
                                        local _, _, trace_id = string.find(log, "TraceID=([0-9a-f]+)")
                                        
                                        if trace_id then
                                            -- Add the trace ID as a new field
                                            record["trace_id"] = trace_id
                                        end
                                    end
                                    
                                    return 1, timestamp, record
                                end
                            EOT
                          - "filter_health_checks.lua" = <<-EOT
                                function filter_health_checks(tag, timestamp, record)
                                    local log = record["log"]
                                    
                                    if log ~= nil and string.match(string.lower(log), "health check") then
                                        return -1, timestamp, record
                                    end
                                    
                                    return 2, timestamp, record
                                end
                            EOT
                        }
                    }
                )
              - version        = "0.48.9"
            },
        ] -> (known after apply)
        name                       = "fluent"
      ~ values                     = [
          ~ <<-EOT
                luaScripts:
                    extract_trace_id.lua: |
                        function extract_trace_id(tag, timestamp, record)
                            local log = record["log"]
                            
                            if type(log) == "string" then
                                -- Try to extract trace ID using pattern matching
                                local _, _, trace_id = string.find(log, "TraceID=([0-9a-f]+)")
                                
                                if trace_id then
                                    -- Add the trace ID as a new field
                                    record["trace_id"] = trace_id
                                end
                            end
                            
                            return 1, timestamp, record
                        end
                    filter_health_checks.lua: |
                        function filter_health_checks(tag, timestamp, record)
                            local log = record["log"]
                            
                            if log ~= nil and string.match(string.lower(log), "health check") then
                                return -1, timestamp, record
                            end
                            
                            return 2, timestamp, record
                        end
                config:
                  inputs: |
                    [INPUT]
                        Name              tail
                        Tag               kube.*
                        Path              /var/log/containers/*.log
                        Parser            docker
                        DB                /var/log/flb_kube.db
                        Mem_Buf_Limit     5MB
                        Skip_Long_Lines   On
                        Refresh_Interval  10
                
                  filters: |
                    [FILTER]
                        Name                kubernetes
                        Match               kube.*
                        Kube_URL            https://kubernetes.default.svc:443
                        Kube_CA_File        /var/run/secrets/kubernetes.io/serviceaccount/ca.crt
                        Kube_Token_File     /var/run/secrets/kubernetes.io/serviceaccount/token
                        Kube_Tag_Prefix     kube.var.log.containers.
                        Merge_Log           On
                        Merge_Log_Key       log_processed
                        K8S-Logging.Parser  On
                        K8S-Logging.Exclude Off
                        
                    [FILTER]
                        Name                record_modifier
                        Match               *
                        Record              log_format structured
                        
                    [FILTER]
                        Name                lua
                        Match               kube.var.log.containers.trace-demo*
                        Script              /fluent-bit/scripts/extract_trace_id.lua
                        Call                extract_trace_id
                
                    [FILTER]
                        Name                lua
                        Match               kube.*
                        Script              /fluent-bit/scripts/filter_health_checks.lua
                        Call                filter_health_checks
                
                  outputs: |
                    [OUTPUT]
                        Name                   loki
                        Match                  *
                        Host                   loki.fullstack.pw
                        Port                   443
                        TLS                    On
                        Labels                 job=fluentbit,cluster=tools
              -         Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app']
              +         Label_Keys             $kubernetes['namespace_name'],$kubernetes['pod_name'],$kubernetes['container_name'],$kubernetes['labels']['app'],$trace_id
                        Remove_Keys            stream
                        Auto_Kubernetes_Labels On
                        Line_Format            json
            EOT,
        ]
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  